---
kind: other
id: Methods.T:Autodesk.Revit.DB.ScheduleFieldId
source: html/a3da39df-9f9f-1b36-e309-35a67ed536d9.htm
---
# ScheduleFieldId Methods

Determines whether the specified Object is equal to the current Object .